//------------------------------------------------------------------------------
//  Purpose: 串口资源控制模块
//  Funtion: 提供基本的串口操作接口和一个中断处理机制
//           需要占用处理机 2 个串口中断源，其中一个为保留资源
//  Dependent：32F207 LIB
//  Designer:
//  Date.Ver:
//------------------------------------------------------------------------------
#ifndef SC_PcCom_H
#define SC_PcCom_H
//------------------------------------------------------------------------------
// Funtion: 向PC串口缓冲区写一个字符数据并等待数据从串口发送完毕
// Input  : chbyte - 发送的数据
// Output : none
// Return : none
// Info   : 查询接口,请注意使用在中断中的效果
//------------------------------------------------------------------------------
void PCComSendByte(unsigned char chbyte );
//------------------------------------------------------------------------------
// Funtion: 向串口缓冲区写多个字符数据并等待数据从串口发送完毕
// Input  : chframe - 发送的数据 chLenth - 数据长度
// Output : none
// Return : none
// Info   : 查询接口,请注意使用在中断中的效果
//------------------------------------------------------------------------------
void PcComSendFrame(unsigned char *chframe, unsigned char chLenth );
//------------------------------------------------------------------------------
// Funtion: 一直等待接收一个数据并在接收到时从串口缓冲区读取这个数据并
//          清空缓冲区
// Input  : none
// Output : none
// Return : 接收数据
// Info   : 查询接口,请注意使用在中断中的效果
//------------------------------------------------------------------------------
unsigned char PCComReadByte(void);
//------------------------------------------------------------------------------
// Funtion: 一定时间内接收一个数据并在接收到时从串口缓冲区读取这个数据
//          并清空缓冲区
// Input  : nWaitMS - 等待溢出时间记数( 时间单位 MS )
//          chByte - 接收的数据
// Output : none
// Return : false 表示没有接收到数据 true 表示接收到数据
// Info   : 查询接口,请注意使用在中断中的效果
//------------------------------------------------------------------------------
char PCComByte( unsigned char *chByte, unsigned int nWaitMS );
//------------------------------------------------------------------------------
// Funtion: 配置并打开串口，所有收发操作前必须打开串口
// Input  : Baudrate - 波特率
// Output : none
// Return : 串口已被打开时返回 false
//          打开串口成功返回 true
// Info   : 请注意给出接收 FIFO 的长度，最好将 FIFO 设置为 1
//------------------------------------------------------------------------------
char PcComOpen( long Baudrate );
//------------------------------------------------------------------------------
// Funtion: 关闭当前串口
// Input  : port - 目标串口
// Output : none
// Return : none
// Info   : none
//------------------------------------------------------------------------------
void PcComClose(void);
#endif
//--------------------------------------------------------- End Of File --------
